### [DataFrame의 인덱스 다루기 - 3]
- 행 인덱스를 정수형인덱스로 초기화 
- 기존 행 인덱스 ==> 컬럼으로 추가 시킴[기본값]
- 메서드 : 변수명.reset_index()

In [29]:
# [1]
import pandas as pd

In [30]:
# [2]
jumsu = {'이름':['마징가','태권v','원더우먼'],
         'kor': [89,100,90],
         'eng': [70, 80 ,90],
         'math' : [99,88,77]}

In [31]:
# [3]
jumsuDF = pd.DataFrame(jumsu)

In [32]:
jumsuDF

     이름  kor  eng  math
0   마징가   89   70    99
1   태권v  100   80    88
2  원더우먼   90   90    77

In [33]:
# [4] 행 인덱스 초기화
DF2= jumsuDF.reset_index()

In [34]:
DF2

   index    이름  kor  eng  math
0      0   마징가   89   70    99
1      1   태권v  100   80    88
2      2  원더우먼   90   90    77

In [35]:
DF2.drop(columns='index',inplace=True)

In [36]:
DF2

     이름  kor  eng  math
0   마징가   89   70    99
1   태권v  100   80    88
2  원더우먼   90   90    77

In [37]:
# [5] 행 인덱스 초기화 ==> 기존행을 컬럼으로 추가하지 않기
DF3= jumsuDF.reset_index(drop=True)
DF3

     이름  kor  eng  math
0   마징가   89   70    99
1   태권v  100   80    88
2  원더우먼   90   90    77